load-test.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 15
      name: Ramp up load
    - duration: 30
      arrivalRate: 15
      name: Sustained load
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 10
  ensure:
    thresholds:
      - http.response_time.p99: 200
      - http.response_time.p95: 150
scenarios:
  - flow:
      - loop:
          - post:
              url: '/api/metadata/achievement/findAll'
          - post:
              url: '/api/metadata/sect/findAll'
        count: 100